Theory:
==========
একটি সংখ্যা N দেওয়া আছে, N এর সব ডিভাইজর di হলে, সবগুলো ডিভাইজর এর ϕ ( Euler Phi ) ফাংশন এর যোগফল হচ্ছে N এর সমান।
For a given integer N, the sum of Euler Phi ( ϕ ) of each of the divisors of N equals to N.
  
Let, N = 12
Divisor of 12 , d = 1 , 2 , 3 , 4 , 6 , 12.

Now, ϕ ( 1 )  = 1 { 1 } ---> Co-Prime smaller than n set.
     ϕ ( 2 )  = 1 { 1 }
     ϕ ( 3 )  = 2 { 1 , 2 }
     ϕ ( 4 )  = 3 { 1 , 2 , 3 }
     ϕ ( 6 )  = 2 { 1 , 5 }
     ϕ ( 12 ) = 4 { 1 , 5 , 7 , 11 }
-----------------------------------------------
sum of ϕ      = 12 = N ( Proved ).
  
Another Approach,
একটা ডিভাইজর d কতবার আছে তা Eular Phi Extension Theorem থেকে নির্ণয় করা যায়। Formula =  ϕ ( N / d ) 

12 এর ডিভাইজর ( ১ , ২ , ৩ , ৪ , ৬ , ১২ ) কোনটা কতবার আছে তা নির্ণয়,
ϕ ( 12 / 1 )  = ϕ ( 12 ) = 4 -> GCD ( a , 12 ) = 1 বা ডিভাইজর ১ পাওয়া যাবে 4 বার GCD ( ১ , ১২ ) , GCD ( ২ , ১২ ) , GCD ( ৩ , ১২ ) ,------,GCD ( ১২ , ১২ ) এর মধ্যে।
ϕ ( 12 / 2 )  = ϕ ( 6 )  = 2
ϕ ( 12 / 3 )  = ϕ ( 4 )  = 3
ϕ ( 12 / 4 )  = ϕ ( 3 )  = 2
ϕ ( 12 / 6 )  = ϕ ( 2 )  = 1
ϕ ( 12 / 12 ) = ϕ ( 1 )  = 1
----------------------------------------------
  Total                  = 12 = N ( Proved )

  
  সুতরাং সব ডিভাইজর ( d ) এর ϕ ( Euler Phi Function ) এর যোগফল অথবা মোট ডিভাইজর এর সংখ্যা হচ্ছে N ( মূল সংখ্যা ) এর সমান । 
