Method-1:
==========
Sum of Number of Divisor  কে Divisor Summatory Function বলা হয়। একটি সংখ্যা N দেওয়া থাকবে। ১ থেকে N পর্যন্ত সব গুলোর NOD বের করে সাথে সাথে যোগ করতে। হবে। 

SNOD ( N ) = ∑N = NOD ( i ) Here, Lower Limit, i = 1 and Upper Limit i = N;

অর্থ্যাৎ ১ থেকে N পর্যন্ত লুপ চালিয়ে NOD ( i ) বের করে যোগ করলেই SNOD ( N ) বের হয়ে যাবে। এক্ষেত্রে Complexity = O ( Loop x NOD ) = O [ N x { sqrt(N) / ln ( N ) } ].
  
Method-2:
=========
  
SNOD ( 10 ) = NOD ( 1 ) + NOD ( 2 ) + ------- + NOD ( 10 )
  
  NOD ( 1 ) = 1               = 1
  NOD ( 2 ) = 1 , 2           = 2
  NOD ( 3 ) = 1 , 3           = 2
  NOD ( 4 ) = 1 , 2 , 4       = 3
  .
  .
  .
  NOD ( 10 ) = 1 , 2 , 5 , 10 = 4
----------------------------------------------
  SNOD ( 10 )                 = 27
  
এখানে ১ সব সংখ্যাকে ভাগ করে। ১ দ্বারা বিভাজ্য সংখ্যা = ১০ / ১ = ১০ টা
                             ২ "    "      "   = ১০ / ২ = ৫ টা
                             ৩ "    "      "   = ১০ / ৩ = ৩ টা
                             .
                             .
                             .
                             ১০ "   "       "  = ১০ / ১০ = ১ টা
  -------------------------------------------------------------------
                          SNOD ( 10 )                     = ২৭ 
                          
১ থেকে N পর্যন্ত লুপ চালিয়ে সহজে SNOD ( N ) বের করা যায়। 
SNOD ( N ) = ( N / 1 ) + ( N / 2 ) + ( N / 3 ) + ----------------- + ( N / N ) = Answer.
  
Complexity: O ( Loop ) = O ( N ).
