Method-1:
==========
Sum of Number of Divisor  কে Divisor Summatory Function বলা হয়। একটি সংখ্যা N দেওয়া থাকবে। ১ থেকে N পর্যন্ত সব গুলোর NOD বের করে সাথে সাথে যোগ করতে। হবে। 

SNOD ( N ) = ∑ NOD ( i ) Here, Lower Limit, i = 1 and Upper Limit i = N;

অর্থ্যাৎ ১ থেকে N পর্যন্ত লুপ চালিয়ে NOD ( i ) বের করে যোগ করলেই SNOD ( N ) বের হয়ে যাবে। এক্ষেত্রে Complexity = O ( Loop x NOD ) = O [ N x { sqrt(N) / ln ( N ) } ].
  
Method-2:
=========
  
SNOD ( 10 ) = NOD ( 1 ) + NOD ( 2 ) + ------- + NOD ( 10 )
  
  NOD ( 1 ) = 1               = 1
  NOD ( 2 ) = 1 , 2           = 2
  NOD ( 3 ) = 1 , 3           = 2
  NOD ( 4 ) = 1 , 2 , 4       = 3
  .
  .
  .
  NOD ( 10 ) = 1 , 2 , 5 , 10 = 4
----------------------------------------------
  SNOD ( 10 )                 = 27
  
এখানে ১ সব সংখ্যাকে ভাগ করে। ১ দ্বারা বিভাজ্য সংখ্যা = ১০ / ১ = ১০ টা
                             ২ "    "      "   = ১০ / ২ = ৫ টা
                             ৩ "    "      "   = ১০ / ৩ = ৩ টা
                             .
                             .
                             .
                             ১০ "   "       "  = ১০ / ১০ = ১ টা
  -------------------------------------------------------------------
                          SNOD ( 10 )                     = ২৭
                          
১ থেকে N পর্যন্ত লুপ চালিয়ে সহজে SNOD ( N ) বের করা যায়। 
SNOD ( N ) = ( N / 1 ) + ( N / 2 ) + ( N / 3 ) + ----------------- + ( N / N ) =  ∑ NOD ( N / i ) Here, Lower Limit, i = 1 and Upper Limit i = N;
  
Complexity: O ( Loop ) = O ( N ).

  
Method-3
============
Divisor Pair : কোন সংখ্যা A এর একটি ডিভাইজর ২ হলে ( A / ২ ) হবে অপর একটি ডিভাই্জর । এটিই ডিভাইজর পেয়ার।যেমন, ( 2 , 10/2 ) = ( 2 , 5 ) হচ্ছে ১০ এর একটা Divisor Pair.

1 থেকে 10 পর্যন্ত সব সংখ্যার Divisor Pair :

DPair ( 1 ) = ( 1 , 1 )                                     = 1
DPair ( 2 ) = ( 1 , 2 ) , ( 2 , 1 )                         = 2
DPair ( 3 ) = ( 1 , 3 ) , ( 3 , 1 )                         = 2
DPair ( 4 ) = ( 1 , 4 ) , ( 2 , 2 ) , ( 4 , 1 )             = 3
.
.
.
DPair ( 10 ) = ( 1 , 10 ) , ( 2 , 5 ) , ( 5 , 2 ) ( 10 , 1 ) = 4
---------------------------------------------------------------------------
Total DParir ( 10 ) = SNOD ( 10 )                            = 27
  
১ থেকে ১০ পর্যন্ত সব সংখ্যার প্রত্যে্কটিকে n ধরলে সংখ্যাগুলো আছে  ( a x b ) = n আকারে। যারা a < b or a == b or a > b এই ভাবে জোরা গঠন করে।

এখানে a বের করে ফেলতে পারলে n/a = b বের করে ফেলতে পারবো। a যেহেতু n এর ছোট ডিভাইজর তাই a হবে সর্বোচ্চ sqrt ( n ). তা না হলে ( a x b ) > n পাওয়া যাবে।
সুতরাং a থেকে sqrt ( n ) পর্যন্ত লুপ চালিয়ে যখন ( n % i == 0 ) পাবো তখন a =  i এবং b = n / i = n / a । এভাবে সকল ডিভাইজর পেয়ার বের করে ফেলতে পারি।    
